
Функция СведенияОВнешнейОбработке() Экспорт 
    
    ИмяОбработки = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним + " " + ЭтотОбъект.Метаданные().Комментарий; 
    Синоним = ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОбработки);
	
    РегистрационныеДанные = Новый Структура();
	
    РегистрационныеДанные.Вставить("Вид", 				"ДополнительнаяОбработка");
    РегистрационныеДанные.Вставить("Наименование", 		Синоним);
    РегистрационныеДанные.Вставить("Версия", 			"1.0");
    РегистрационныеДанные.Вставить("БезопасныйРежим", 	Ложь);
    РегистрационныеДанные.Вставить("Информация", 		"Обработка " + Синоним);

	ТаблицаКоманд = ПолучитьТаблицуКоманд();

	ДобавитьКоманду(ТаблицаКоманд, Синоним, "1" , "ОткрытиеФормы", Истина, );
    
    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);

    Возврат РегистрационныеДанные;

КонецФункции

Функция ПолучитьТаблицуКоманд()

    Команды = Новый ТаблицаЗначений;

    Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
    Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево")); 
    Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор)
    
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры
